workshops/railsconf-2010/01_railsconf_workshops/app/controllers/articles_controller.rb

SELECT * FROM `categories`
SELECT * FROM `states`
SELECT * FROM `articles`
---
  def index
    conditions = {}
    conditions[:category_id] = params[:category] if params[:category].present?
    conditions[:state_id] = params[:state] if params[:state].present?

    @articles = Article.all(:conditions => conditions)

SELECT * FROM `articles` WHERE (`articles`.`id` = 10)
---
  def show
    @article = Article.find(params[:id])

SELECT * FROM `articles` WHERE (`articles`.`id` = 9)
---
  def edit
    @article = Article.find(params[:id])

INSERT INTO `articles` (`created_at`, `title`, `body`, `updated_at`, `category_id`, `state_id`) VALUES('2010-06-06 22:57:40', NULL, NULL, '2010-06-06 22:57:40', 7, 8)
---
  def create
    @article = Article.new(params[:article])

    if @article.save

SELECT * FROM `articles` WHERE (`articles`.`id` = 11)
---
  def update
    @article = Article.find(params[:id])

SELECT * FROM `articles` WHERE (`articles`.`id` = 7)
DELETE FROM `articles` WHERE `id` = 7
---
  def destroy
    @article = Article.find(params[:id])
    @article.destroy

SELECT * FROM `articles` WHERE (`articles`.`id` = 8)
---
  def flag
    article = Article.find(params[:id])